# пример вектора (время оперативного реагирования)
x <- c(16.86, 16.4, 15.64, 10.03, 20.95, 9.3, 2.89, 12.46,
       17.31, 16.03, 20.24, 8.07, 12.53, 6.79, 7.01, 8.12, 6.54,
       7.55, 4.4, 7.19, 14.92, 3.99, 8.3, 21.87, 15.19, 8.39, 3.96,
       9.02, 5.14, 4.56, 4.69, 6.24, 4.83, 4.8, 5.8, 6.02, 3.95,
       10.76, 4.65, 6.07, 3.55, 5.73, 7.85, 11.87, 3.76, 7.02,
       11.01, 5.88, 8.87, 4.87, 23.02, 7.68, 9.58, 6.25, 10.09,
       6.92, 5.59, 8.55, 6.99, 6.62, 6.61, 3.5, 8.25, 12.13, 6.79,
       6.4, 6.26, 7.23, 6.22, 7.27, 7.42, 4.53, 5.83, 7.28, 10.52,
       10, 7.7, 9.17, 16.52, 6.3, 10.16, 22.98, 12.91, 8.9)

# вычисляем среднее значение
mean(x)

# вычисляем медиану
median(x)

# размах
range(x)

# выборочное среднее
sd(x)

# квантили
quantile(x, 0.25)
quantile(x, 0.75)

# интерквантильный размах
IQR(x)

# асимметрия
moments::skewness(x)

# эксцесс
moments::kurtosis(x)

# описание выборки
summary(x)
fivenum(x)
psych::describe(x)
# Hmisc::describe(x)
pastecs::stat.desc(x)
